//- Дано натуральное число n. Выведите все числа от 1 до n.

// let nat = (nbs)=>{
//      for(let i=1;i<=nbs;i++){
//         console.log(i);
//     }
// }
// nat(+prompt('Введите число N'));


// Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

// let boom = (a, b) => {
//     if (a < b) {
//         for (a; a <= b; a++) {
//             console.log(a);
//         }
//     }
//     else if (a>b) {
//         for (a; a >= b; a--) {
//             console.log(a);
//         }
//     }
// }
// boom(+prompt('Введите число А'),+prompt('Введите число В'));

//     -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//

// let boom = (arr,i) => {
//     let x = arr[i];
//     arr[i]=arr[i+1];
//     arr[i+1]= x;
//     console.log(arr);
// }
//
// let foo =[9,8,0,4];
// boom(foo,+prompt('Введите число i'));